test/graphs/graph_test/single_node_with_customer_and_supplier_depth_2.dot
digraph unix {
    graph [nodesep = 0.25; ranksep=1];
    fontname="Helvetica,Arial,sans-serif"
    node [fontname="Helvetica,Arial,sans-serif"]
    edge [fontname="Helvetica,Arial,sans-serif"]
    subgraph cluster_level2_3 {
        label = "level2";
        subgraph cluster_level1_4 {
            label = "level1";
            subgraph cluster_level0_5 {
                label = "level0";
                style = filled;
                fillcolor = "#DDDDDD";
                x_7 [
                label="x"
                style = filled;
                fillcolor = "#EEEEEE";
                ];
                
            }
            s1_5 [
            label="s1"
            ];
            s0_6 [
            label="s0"
            ];
            c0_8 [
            label="c0"
            ];
            c1_9 [
            label="c1"
            ];
            
        }
        s11_1 [
        label="s11"
        ];
        s10_2 [
        label="s10"
        ];
        s01_3 [
        label="s01"
        ];
        s00_4 [
        label="s00"
        ];
        c00_10 [
        label="c00"
        ];
        c01_11 [
        label="c01"
        ];
        c10_12 [
        label="c10"
        ];
        c11_13 [
        label="c11"
        ];
        
    }
    "s11_1" -> "s1_5";
    "s10_2" -> "s1_5";
    "s01_3" -> "s0_6";
    "s00_4" -> "s0_6";
    "s1_5" -> "x_7";
    "s0_6" -> "x_7";
    "c0_8" -> "c00_10";
    "c0_8" -> "c01_11";
    "c1_9" -> "c10_12";
    "c1_9" -> "c11_13";
    "x_7" -> "c0_8";
    "x_7" -> "c1_9";
}
